maintainence_app/lib/test.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZFM_MP_WK_EDIT_AJ>
         <!--You may enter the following 13 items in any order-->
         <!--Optional:-->
         <DURATION></DURATION>
         <!--Optional:-->
         <EQUIP></EQUIP>
         <!--Optional:-->
         <MATQTY></MATQTY>
         <!--Optional:-->
         <NOTIFTYPE></NOTIFTYPE>
         <!--Optional:-->
         <NOTIF_NO></NOTIF_NO>
         <!--Optional:-->
         <OPNDESC></OPNDESC>
         <!--Optional:-->
         <ORDERTYPE></ORDERTYPE>
         <!--Optional:-->
         <PERS></PERS>
         <!--Optional:-->
         <PRIORITY></PRIORITY>
         <!--Optional:-->
         <RESERVE></RESERVE>
         <!--Optional:-->
         <SHORTTEXT></SHORTTEXT>
         <!--Optional:-->
         <WOID></WOID>
         <RETURN>
            <!--Zero or more repetitions:-->
            <item>
               <!--Optional:-->
               <TYPE></TYPE>
               <!--Optional:-->
               <ID></ID>
               <!--Optional:-->
               <NUMBER></NUMBER>
               <!--Optional:-->
               <MESSAGE></MESSAGE>
               <!--Optional:-->
               <LOG_NO></LOG_NO>
               <!--Optional:-->
               <LOG_MSG_NO></LOG_MSG_NO>
               <!--Optional:-->
               <MESSAGE_V1></MESSAGE_V1>
               <!--Optional:-->
               <MESSAGE_V2></MESSAGE_V2>
               <!--Optional:-->
               <MESSAGE_V3></MESSAGE_V3>
               <!--Optional:-->
               <MESSAGE_V4></MESSAGE_V4>
               <!--Optional:-->
               <PARAMETER></PARAMETER>
               <!--Optional:-->
               <ROW></ROW>
               <!--Optional:-->
               <FIELD></FIELD>
               <!--Optional:-->
               <SYSTEM></SYSTEM>
            </item>
         </RETURN>
      </urn:ZFM_MP_WK_EDIT_AJ>
   </soapenv:Body>
</soapenv:Envelope>